---
kind: property
id: P:Autodesk.Revit.DB.CurveByPointsArray.Item(System.Int32)
source: html/70cf4ab5-6187-8672-68c8-3de2f5457889.htm
---
# Autodesk.Revit.DB.CurveByPointsArray.Item Property

Gets or sets a curve at a specified index within the array.

## Syntax (C#)
```csharp
public virtual CurveByPoints this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the curve to be set or retrieved.

## Returns
Returns the curve at the specified index.